; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_6 ?v1)
		(pred_4 ?v3)
		(pred_5 ?v3)
		(pred_2 ?v1 ?v3)
		(pred_1)
		(pred_3 ?v1))

   (:action op_3
       :parameters  (?v2 ?v5)
       :precondition (and (not-eq ?v2 ?v5) 
                          (pred_4 ?v2) (pred_4 ?v5) (pred_5 ?v2))
       :effect (and  (pred_5 ?v5)
		     (not (pred_5 ?v2))))


   (:action op_2
       :parameters (?v6 ?v8)
       :precondition  (and  (pred_6 ?v6) (pred_4 ?v8)
			    (pred_2 ?v6 ?v8) (pred_5 ?v8) (pred_1))
       :effect (and (pred_3 ?v6)
		    (not (pred_2 ?v6 ?v8)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v6  ?v8)
       :precondition  (and  (pred_6 ?v6) (pred_4 ?v8)
			    (pred_3 ?v6) (pred_5 ?v8))
       :effect (and (pred_2 ?v6 ?v8)
		    (pred_1)
		    (not (pred_3 ?v6)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_05 obj_08 obj_02 obj_04 obj_06 obj_07 
          obj_03 obj_01 
)
(:init
(pred_4 obj_05)
(pred_4 obj_08)
(pred_4 obj_02)
(pred_4 obj_04)
(pred_4 obj_06)
(pred_4 obj_07)
(pred_6 obj_03)
(pred_6 obj_01)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(pred_1)
(pred_2 obj_03 obj_02)
(pred_2 obj_01 obj_04)
(pred_5 obj_08)
)
(:goal
(and
(pred_2 obj_03 obj_07)
(pred_2 obj_01 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_03 obj_07) (pred_5 obj_05))
    (sometime-before  (pred_2 obj_01 obj_05) (pred_5 obj_02))
  )
)
)

; plan
1. (op_3 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_02)
   goals met: 0 of 2
2. (op_2 obj_03 obj_02)
   deleted: (pred_2 obj_03 obj_02) (pred_1)
   added: (pred_3 obj_03)
   goals met: 0 of 2
3. (op_3 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_04)
   goals met: 0 of 2
4. (op_1 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_2 obj_03 obj_04) (pred_1)
   goals met: 0 of 2
5. (op_2 obj_01 obj_04)
   deleted: (pred_2 obj_01 obj_04) (pred_1)
   added: (pred_3 obj_01)
   goals met: 0 of 2
6. (op_3 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_05)
   goals met: 0 of 2
7. (op_1 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_2 obj_01 obj_05) (pred_1)
   goals met: 1 of 2
8. (op_3 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_04)
   goals met: 1 of 2
9. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_03 obj_04) (pred_1)
   added: (pred_3 obj_03)
   goals met: 1 of 2
10. (op_3 obj_04 obj_07)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_07)
   goals met: 1 of 2
11. (op_1 obj_03 obj_07)
   deleted: (pred_3 obj_03)
   added: (pred_2 obj_03 obj_07) (pred_1)
   goals met: 2 of 2
